export default [
  {
    id: 1,
    name: "Gantt Chart全件取得、縦スクロール",
    desc: "100件まで1ページとして取得する",
    values: [
      {
        from: "2024-04-03 00:00:00.000",
        to: "2024-04-03 23:59:59.999",
        label: "Gantt Chart全件取得、縦スクロール",
        customClass: "ganttBlue",
      },
    ],
  },
  {
    id: 2,
    name: "並び替え機能",
    desc: "並び替え機能",
    values: [
      {
        from: "2024-04-04 00:00:00.000",
        to: "2024-04-09 23:59:59.999",
        label: "並び替え機能",
        customClass: "ganttBlue",
      },
    ],
  },
  {
    id: 3,
    name: "「続けて表示」ボタン機能",
    desc: "行を複数選択するできるようする。リセットできるようにする。続けて表示をした場合は状態保存はしない。",
    values: [
      {
        from: "2024-04-10 00:00:00.000",
        to: "2024-04-12 23:59:59.999",
        label: "「続けて表示」ボタン機能",
        customClass: "ganttBlue",
      },
    ],
  },
  {
    id: 4,
    name: "並び替え：自動スクロール",
    desc: "並び替え：項目をドラッグしている際に自動スクロール等してほしい。",
    values: [
      {
        from: "2024-04-15 00:00:00.000",
        to: "2024-04-16 23:59:59.999",
        label: "並び替え：自動スクロール",
        customClass: "ganttBlue",
      },
    ],
  },
  {
    id: 5,
    name: "ページ件数の設定",
    desc: "1ページの表示数を設定できるようにする。",
    values: [
      {
        from: "2024-04-16 00:00:00.000",
        to: "2024-04-16 23:59:59.999",
        label: "ページ件数の設定",
        customClass: "ganttBlue",
      },
    ],
  },
  {
    id: 6,
    name: "バーの長さ調整機能",
    desc: "⇦ハンドルは不要。変わった分を表示したい。元の日に対して、＋-された情報を表示するように。",
    values: [
      {
        from: "2024-04-15 00:00:00.000",
        to: "2024-04-18 23:59:59.999",
        label: "バーの長さ調整機能",
        customClass: "ganttBlue",
      },
    ],
  },
  {
    id: 7,
    name: "調査：祝日情報を取得方法",
    desc: "調査：祝日情報を取得方法",
    values: [
      {
        from: "2024-04-19 00:00:00.000",
        to: "2024-04-19 23:59:59.999",
        label: "調査：祝日情報を取得方法",
        customClass: "ganttBlue",
      },
    ],
  },
  {
    id: 8,
    name: "開始・終了日がない対応",
    desc: "バーの開始と終了、両方のデータがない場合の対応",
    values: [
      {
        from: "2024-04-22 00:00:00.000",
        to: "2024-04-24 23:59:59.999",
        label: "開始・終了日がない対応",
        customClass: "ganttBlue",
      },
    ],
  },
  {
    id: 9,
    name: "進捗率",
    desc: "調査（保留）：進捗率による色付け機能",
    values: [
      {
        from: "2024-04-25 00:00:00.000",
        to: "2024-04-26 23:59:59.999",
        label: "進捗率",
        customClass: "ganttBlue",
      },
    ],
  },
  {
    id: 10,
    name: "ドキュメント作成",
    desc: "動作検証及びドキュメント作成",
    values: [
      {
        from: "2024-04-26 00:00:00.000",
        to: "2024-05-07 23:59:59.999",
        label: "ドキュメント作成",
        customClass: "ganttBlue",
      },
    ],
  },
  {
    id: 11,
    name: "ブラウザー側で保存",
    desc: "全てのデーターをブラウザー側で保存する。DBから削除されたデーターは、UIに薄色で表示する　ブラウザー側のデーターを「１件」、「全件」削除機能（右クリック）。",
    values: [
      {
        from: "2024-05-07 00:00:00.000",
        to: "2024-05-13 23:59:59.999",
        label: "ブラウザー側で保存",
        customClass: "ganttBlue",
      },
    ],
  },
  {
    id: 12,
    name: "マイルストーン表示機能",
    desc: "マイルストーン：バー以外の項目：評価ROMリリース、評価レビュー日、顧客提出日、顧客MRD",
    values: [
      {
        from: "2024-05-14 00:00:00.000",
        to: "2024-05-17 23:59:59.999",
        label: "マイルストーン表示機能",
        customClass: "ganttBlue",
      },
    ],
  },
  {
    id: 13,
    name: "続けて表示：関係性の表示線",
    desc: "選択されたバーとバーの間に線を引く。",
    values: [
      {
        from: "2024-05-21 00:00:00.000",
        to: "2024-05-28 23:59:59.999",
        label: "続けて表示：関係性の表示線",
        customClass: "ganttBlue",
      },
    ],
  },
];
